package chapter.seven_2nd._13; // ← 소스파일의 첫 문장은 항상 패키지 선언문이다.

public class Chapter07_13 {

  /** ◆ 패키지의 선언
   *
   * 패키지 선언이란 현재 소스파일에 작성된 클래스들이 어떤 패키지에 속한 것인지를 알려주는 것이다.
   * 패키지를 선언하는 것은 아주 간단하다. 클래스나 인터페이스의 소스 파일(.java) 맨 위에 다음과 같이 한 줄만 적어주면 된다.
   * ================
   * package 패키지명;
   * ================
   *
   * 위와 같이 패키지 선언문은 반드시 소스파일에서 주석과 공백을 제외한 첫 번째 문장이어야 하며, 하나의 소스파일에 단 한번만 선언할 수 있다.
   * 해당 소스파일에 포함된 모든 클래스나 인터페이스는 선언된 패키지에 속하게 된다.
   *
   * 모든 클래스는 반드시 하나의 패키지에 포함되어야 한다고 했다. 그럼에도 불구하고 지금까지 소스파일을 작성할 때 패키지를 선언하지 않고도
   * 아무런 문제가 없었던 이유는 자바에서 기본적으로 제공하는 '이름 없는 패키지(unnamed package)' 때문이다.
   *
   * 소스파일에 자신이 속할 패키지를 지정하지 않은 클래스는 자동적으로 '이름 없는 패키지'에 속하게 된다. 결국 패키지를 지정하지 않는 모든 클래스들은
   * 같은 패키지에 속하는 셈이다. 간단한 프로그램은 패키지를 지정하지 않아도 별 문제 없지만, 큰 프로젝트나 Java API 와 같은 클래스 라이브러리를
   * 작성하는 경우에는 미리 패키지를 구성하여 적용해야 한다.
   *
   *
   *
   *
   * */

}
