package chapter.seven._43;

public class Chapter07_43 {

  /** ◆ 내부 클래스의 종류와 특징
   *
   * 내부 클래스의 종류는 변수의 선언위치에 따른 종류와 같다. 내부 클래스는 마치 변수를 선언하는 것과 같은 위치에 선언할 수 있으며,
   * 변수가 선언위치에 따라 인스턴스 변수, 클래스 변수(static 변수), 지역 변수로 구분되는 것과 같이 내부 클래스도 선언위치에 따라
   * 다음과 같이 구분되어 진다. 내부 클래스의 유효 범위와 성질이 변수와 유사하므로 서로 비교해보면 이해하는데 많은 도움이 된다.
   *
   * 1. 인스턴스 클래스 (instance class)
   * : 외부 클래스의 멤버변수 선언위치에 선언하며, 외부 클래스의 인스턴스 멤버처럼 다루어진다. 주로 외부 클래스의 인스턴스 멤버들과
   *   관련된 작업에 사용될 목적으로 선언된다.
   *
   * 2. 스태틱 클래스 (static class)
   * : 외부 클래스의 멤버변수 선언위치에 선언하며, 외부 클래스의 static 멤버처럼 다루어진다. 주로 외부 클래스의 static 멤버,
   *   특히 static 메서드에서 사용될 목적으로 선언된다.
   *
   * 3. 지역 클래스 (local class)
   * : 외부 클래스의 메서드나 초기화 블럭 안에 선언하며, 선언된 영역 내에서만 사용될 수 있다.
   *
   * 4. 익명 클래스 (anonymous class)
   * : 클래스의 선언과 객체 생성을 동시에 하는 이름없는 클래스(일회용)
   *
   * */

}
