package chapter.seven.chapter_07_32;

public class Chapter07_32 {

  /** ◆ 추상 메서드 (abstract method)
   *
   * 메서드는 선언부와 구현부(몸통)로 구성되어 있다고 했다. 선언부만 작성하고 구현부는 작성하지 않은 채로 남겨 둔 것이 추상 메서드다.
   * 즉, 설계만 해놓고 실제 수행될 내용은 작성하지 않았기 때문에 미완성 메서드인 것이다.
   *
   * 메서드를 이와 같이 미완성 상태로 남겨 놓은 이유는 메서드의 내용이 상속받는 클래스에 따라 달라질 수 있기 때문에 조상 클래스에서는
   * 선언부만 작성하고, 주석을 덧붙여 어떤 기능을 수행할 목적으로 작성되었는지 알려주고, 실제 내용은 상속받는 클래스에서 구현되도록
   * 비워 두는 것이다. 그래서 추상 클래스를 상속 받는 자손 클래스는 조상의 추상 메서드를 상황에 맞게 적절히 구현해주어야 한다.
   * 추상 메서드 역시 키워드 'abstract' 를 앞에 붙여주고, 추상 메서드는 구현부가 없으므로 괄호{} 대신 문장의 끝을 알리는 ';' 을 적어준다.
   *
   * ---------------------------------------------------------------------------
   * 주석을 통해 어떤 기능을 수행할 목적으로 작성하였는지 설명한다.
   * abstract 리턴타입 메서드이름();
   * ---------------------------------------------------------------------------
   *
   *
   * */

}
