package chapter.six_2nd._16;

public class Chapter06_16 {

  /** ◆ 메서드의 구현부
   *
   * 메서드의 선언부 다음에 오는 괄호 {}를 '메서드의 구현부'라고 하는데, 여기에 메서드를 호출했을 때 수행될 문장들을 넣는다. 우리가 그동안 작성해온
   * 문장들은 모두 main 메서드의 구현부{}에 속한 것들이었으므로 지금까지 하던대로만 하면된다.
   *
   * 1. return 문
   * 메서드의 반환타입이 'void' 가 아닌 경우, 구현부{} 안에 'return 반환값;' 이 반드시 포함되어야 한다. 이 문장은 작업을 수행한 결과인 반환값을 호출한
   * 메서드로 전달하는데, 이 값의 타입은 반환타입과 일치하거나 적어도 자동 형변환이 가능한 것이어야 한다.
   *
   * 여러 개의 변수를 선언할 수 있는 매개변수와 달리 return 문은 단 하나의 값만 반환할 수 있는데, 메서드로의 입력(매개변수)은 여러 개일 수 있어도 출력(반환값)은
   * 최대 하나만 허용하는 것이다.
   *
   * 2. 지역 변수
   * 메서드 내에 선언된 변수들은 그 메서드 내에서만 사용할 수 있으므로 서로 다른 메서드라면 같은 이름의 변수를 선언해도 된다. 이처럼 메서드 내에 선언된 변수를
   * 지역 변수(local variable) 이라고 한다.
   * ※ 매개변수도 메서드 내에 선언된 것으로 간주되므로 지역변수이다.
   *
   * int add(int x, int y) {
   *   int result = x + y;
   *   return result;
   * }
   *
   * int multiply(int x, int y) {
   *   int result = x + y;
   *   return result;
   * }
   *
   * 위에 정의된 메서드 add 와 multiply 에 각기 선언된 변수, x, y, result 는 이름만 같을 뿐 서로 다른 변수이다.
   *
   * */

}
