package chapter.two;

public class Chapter02_12 {

  /** ◆ printf를 이용한 출력
   * 지금까지 사용해 온 println()의 경우 사용하기 편하지만 변수의 값을 그대로 출력해야 하고
   * 다른 형식으로 출력하려면 값을 변환해야만 한다는 단점이 있다. 같은 값이라도 다른 형식으로
   * 출력하고 싶다면 printf()를 사용할 수 있다.
   *
   * printf()는 '지시자'를 통해 변수의 값을 여러 가지 형식으로 변환하여 출력하는 기능을 가지고 있다.
   * '지시자'는 값을 어떻게 출력할 것인지를 지시해주는 역할을 한다. 예를 들어 다음과 같다.
   *
   *  int age = 14;
   *  System.out.printf("age:%d", age);
   *  //화면에 "age:14"가 출력된다.
   *
   * 만일 출력하려는 값이 2개라면 '지시자' 역시 2개를 사용해야 하며 출력될 값과 지시자의 순서는
   * 반드시 일치해야 한다. 3개의 이상의 값도 출력할 수 있으며 개수의 제한은 없다.
   *
   * 또한 printf()는 println()과 달리 출력 후 줄바꿈을 하지 않는다. 줄바꿈을 하려면
   * 지시자 %n을 따로 사용해야 한다.
   *
   * 지시자 중 자주 사용되는 것을 따로 분류하자면 다음과 같다.
   *
   *  %d : 10진(decimal)의 정수 형식으로 출력
   *  %x : 16진(hexa-decimal)의 정수 형식으로 출력
   *  %f : 부동 소수점(floating point)의 형식으로 출력
   *  %c : 문자(character)의 형식으로 출력
   *  %s : 문자열(String)의 형식으로 출력
   *
   *
   * */

}
