package chapter.two;

public class Chapter02_10 {

  /** ◆ 기본형과 참조형
   *
   * 우리가 주로 사용하는 값(data)의 종류는 크게 '문자와 숫자'로 나눌 수 있으며, 숫자는 다시
   * '정수와 실수'로 나눌 수 있다.
   *
   *                문자: 'A', '1', "ABC"
   *             ↗︎
   *    값(data)
   *             ↘︎      ↗ 정수: 123, 0, -100  ︎
   *                숫자
   *                     ↘ 실수︎: 3.14, -3.0 x 10^8
   *
   * 이러한 값(data)의 종류(type)에 따라 값이 저장될 공간의 크기와 저장 형식을 정의한 것이 자료형(data type)이다.
   * 자료형에는 문자형(char),  정수형(byte, short, int, long), 실수형(float, double) 등이 있으며 변수를
   * 선언할 때는 저장하려는 값의 특징을 고려하여 가장 알맞은 자료형을 변수의 타입으로 선택하면 된다.
   *
   * 자료형은 크게 '기본형'과 '참조형' 두 가지로 나눌 수 있는데, 기본형 변수는 실제 값(data)을 저장하는 반면, 참조형 변수는
   * 어떤 값이 저장되어 있는 주소(memory address)를 값으로 갖는다.
   *
   * 메모리에는 1byte단위로 일련번호가 붙어있는데, 이 번호를 '메모리 주소' 또는 간단히 '주소'라고 한다. 객체의 주소는
   * 객체가 저장된 메모리 주소를 말한다.
   *
   *  1. 기본형 (primitive type)
   *  = 논리형(boolean), 문자형(char), 정수형(byte, short, int, long), 실수형(float, double)
   *  계산을 위한 실제 값을 저장한다. 8개
   *
   *  2. 참조형 (reference type)
   *  = 객체의 주소를 저장한다. 8개의 기본형을 제외한 나머지 타입.
   *
   *  ◆ 기본형의 종류와 범위
   *  기본형에는 모두 8개의 타입이 있으며 크게 논리형, 문자형, 정수형, 실수형이 있다.
   *  정수형 중에는 int가 기본이고 실수형 중에는 double 이 기본이다.
   *
   *  ------------------------------------------------------------
   *       크기   | 1byte     |   2byte    |  4byte    |  8byte
   *   종류
   *  논리형         boolean
   *  문자형                       char
   *  정수형          byte        short         int        long
   *  실수형                                  float       double
   *  ------------------------------------------------------------
   *  기본형의 종류와 크기는 반드시 외워야 한다.
   *
   *  • boolean은 true와 false 두 가지 값만 표현하면 되므로 가장 작은 크기인 1byte
   *  • char는 자바에서 유니코드(2byte 문자체계)를 사용하므로 2byte.
   *  • int(4byte)를 기준으로 짧아서 short(2byte), 길어서 long(8byte)
   *  • float는 실수값을 부동소수점(floating-point) 방식으로 저장하기 때문에 float
   *  • double 은 float보다 2배의 크기(8byte)를 갖기 때문에 double.
   *
   * 각 자료형이 가진 값의 범위는 정확히 외울 필요는 없고, 정수형의 경우 '-2^n-1 ~ 2^n-1 - 1' 라는 걸 기억하면 된다.
   * int 타입의 변수는 대략 10자리 수 (20억)의 값을 저장할 수 있다.
   *
   *
   *
   * */

}
