package chapter.two;

public class Chapter02_08 {

  /** ◆ 문자열 결합
   * 숫자 뿐만 아니라 아래와 같이 두 문자열을 합칠 때도 덧셈(+)을 사용할 수 있다.
   *  String name = "Ja" + "va";
   *  String str = name + 8.0;
   *
   * 덧셈 연산자는 피연산자가 모두 숫자일 때는 두 수를 더하지만, 피연산자 중 어느 한 쪽이 String이면
   * 나머지 한 쪽을 먼저 String으로 변환한 다음 두 String을 결합한다.
   * 어떤 타입의 변수도 문자열과 덧셈 연산을 수행하면 그 결과가 문자열이 된다.
   *
   *  문자열 + any type → 문자열 + 문자열 → 문자열
   *  any type + 문자열 → 문자열 + 문자열 → 문자열
   *
   * 예를 들어, 7 + "7"을 계산할 때 7이 String이 아니므로 먼저 7을 String으로 변환한 다음
   *  "7" + "7"을 수행하여 "77"을 얻는다.
   * 다음은 몇 가지 결합의 예시이다.
   *  7 + " " → "7" + " " → "7 "
   *  " " + 7 → " " + "7" → " 7"
   *  7 + "7" → "7" + "7" → "77"
   *  7 + 7 + "" → 14 + "" → "14" + "" → "14"
   *  "" + 7 + 7 → "" + "7" + 7 → "7" + 7 → "7" + "7" → "77"
   *
   * 덧셈 연산자는 왼쪽에서 오른쪽의 방향으로 연산을 수행하기 때문에 결합순서에 따라 결과가 달라지므로 주의
   *  어떤 타입을 문자열로 변환하고 싶을 때에는 아무런 내용이 없는 빈 문자열("")을 더해주면 된다.
   * */
}
