package chapter.two;

public class Chapter02_03 {

  /**
  *  ◆ 변수의 선언과 저장
  *
  * 변수란? -> '하나의 값을 저장할 수 있는 공간'
  * 저장공간, 즉 변수가 필요하다면 먼저 변수를 선언해야 한다. 변수를 선언하는 방법은 다음과 같다.
  *
  * --------------
  * 변수타입 변수이름;
  * --------------
  * 변수의 타입은 변수에 저장할 값이 어떤 것이냐에 따라 달라지며, 변수의 이름은 저장공간이
  * 서로 구별될 수 있어야 하기 때문에 필요하다. 예를 들어, 정수(integer)를 저장할 공간이
  * 필요하다면 다음과 같이 변수를 선언한다.
  *
  * int x;
  *
  * 위의 문장이 수행되면, x라는 이름의 변수(저장공간)이 생성된다.
  * 그리고 이 변수에 값을 저장할 때는 다음과 같이 한다.
  *
  * x = 5;
  *
  * 수학에서는 '='가 같음을 의미하지만, 자바에서는 오른쪽의 값을 왼쪽에 저장하라는
  * '대입 연산자'이다. 혼동하지 않도록 주의해아 한다.
  *
  * x = 3;
  *
  * 변수는 오직 하나의 값만을 저장할 수 있기 때문에, 이미 값이 저장된 변수에
  * 새로운 값을 저장하면 기존의 값은 지워지고 새로 저장된 값만 남게 된다.
  *
  * 변수의 선언과 대입은 한 줄로 간단히 할 수도 있다.
  *
  * int x;
  * x = 5;     ->  int x = 5;
  *
  *
  *
  * */
}
