package chapter.six_2nd._12;

public class Chapter06_12 {
  /** ◆ 클래스 변수와 인스턴스 변수
   *
   * 클래스 변수와 인스턴스 변수의 차이를 이해하기 위한 예로 카드 게임에 사용되는 카드를 클래스로 정의해보자.
   *
   * 카드 클래스를 작성하기 위해서는 먼저 카드를 분석해서 속성과 기능을 알아내야 한다. 속성으로는 카드의 무늬, 숫자, 폭, 높이 정도를 생각해볼 수 있다.
   * 이 중에서 어떤 속성을 클래스 변수로 선언할 것이며, 또 어떤 속성들을 인스턴스 변수로 선언할 것인지 한번 생각해보자.
   *
   * 속성 : 무늬, 숫자     |     폭, 높이
   *          ↓                 ↓
   *       인스턴스 변수   |    클래스 변수
   *        (개별 속성)   |    (공통 속성)
   * class Card {
   *
   *  String Kind; //무늬(개별 속성, 카드마다 다를 수 있음)
   *  int number; //숫자(개별 속성)
   *
   *  static int width; //폭 (공통 속성, 카드 모두 동일)
   *  static int height; //높이
   *
   * }
   *
   *  이 Card 인스턴스는 자신만의 무늬(kind) 와 숫자(number)를 유지하고 있어야 하므로 이들을 인스턴스 변수로 선언하였고, 각 카드 폭(width)와
   *  높이(height)는 모든 인스턴스가 공통적으로 같은 값을 유지해야하므로 클래스 변수로 선언하였다.
   *
   *  카드의 폭을 변경해야할 필요가 있을 경우, 한 카드의(width)값만 변경해도 모든 카드의 width 값이 변경되는 셈이다.
   *
   *  ※ 인스턴스 변수는 인스턴스가 생성될 때 마다 생성되므로 인스턴스마다 각기 다른 값을 유지할 수 있지만, 클래스 변수는 모든 인스턴스가 하나의
   *    저장공간을 공유하므로 항상 공통된 값을 갖는다.
   *
   *
   *
   * */

}
