package chapter.eleven._39;

public class Chapter11_39 {

  /** ◆ TreeSet
   *
   * TreeSet 은 이진 검색 트리(binary search tree) 라는 자료구조의 형태로 데이터를 저장하는 컬렉션 클래스이다.
   * 이진 검색 트리는 정렬, 검색, 범위검색(range search) 에 높은 성능을 보이는 자료구조이며 TreeSet 은 이진 검색 트리의 성능을 향상 시킨
   * '레드-블랙 트리' 로 구현되어 있다.
   *
   * 그리고 Set 인터페이스를 구현했으므로 중복된 데이터의 저장을 허용하지 않으며 정렬된 위치에 저장하므로 저장 순서를 유지하지도 않는다.
   * 이진 트리(binary tree)는 LinkedList 처럼 여러 개의 노드(node) 가 서로 연결된 구조로, 각 노드에 최대 2개의 노드를 연결할 수 있으며
   * '루트(root)' 라고 불리는 하나의 노드에서부터 시작해서 계속 확장해 나갈 수 있다.
   *
   * 위 아래로 연결된 두 노드를 '부모-자식' 관계에 있다고 하며 상위 노드를 부모 노드, 하위 노드를 자식 노드라고 한다. 부모-자식 관계는 상대적인 것이며
   * 하나의 부모 노드는 최대 두 개의 자식노드와 연결될 수 있다.
   *
   *          루트
   *        /     \
   *       A
   *     /  \
   *    B   C
   *
   * 위의 그림에서 A 는 B 와 C 의 부모 노드이고, B 와 C 는 A 의 자식 노드이다.
   * ※ tree 라는 이름은 각 노드가 연결된 모양이 나무와 같다고 해서 붙여진 이름이다.
   *
   * 이진 트리의 노드를 코드로 표현하면 다음과 같다.
   *
   * class TreeNode {
   *   TreeNode left; // 왼쪽 자식 노드
   *   Object element; // 객체를 저장하기 위한 참조변수
   *   TreeNode right; // 오른쪽 자식 노드
   * }
   *
   * 데이터를 저장하기 위한 Object 타입의 참조변수 하나와 두 개의 노드를 참조하기 위한 두 개의 참조변수를 선언했다.
   *
   *
   *
   *
   *
   * */

}
