package chapter.three;

public class Chapter03_02 {

  /** ◆ 연산자의 종류
   *
   * 연산자에는 다음과 같은 것들이 있다.
   * --------------------------------------------------------------------
   * 산술 연산자 : +, -, *, /, %, <<, >>
   * 비교 연산자 : >, <, >=, <=, ==, !=
   * 논리 연산자 : &&, ||, !, &, |, ^, ~
   * 대입 연산자 : =
   * 기타 : (type), ?:, instanceof / 형변환 연산자, 삼항 연산자, instanceof 연산자
   * ---------------------------------------------------------------------
   *
   * 연산자를 분류할 때, 피연산자의 갯수에 따라 분류하기도 하는데
   * 피연산자 개수가 하나면 '단항 연산자', 2개면 '이항 연산자', 3개면 '삼항 연산자'라고 부른다.
   *
   *  -3 - 5
   *
   *  위 식에는 두 개의 연산자가 포함되어 있는데, 둘 다 같은 '-'기호로 나타내지만 엄연히 다른 연산자이다.
   *  왼쪽의 -는 '부호 연산자'로써 피연산자의 부호를 바꿔주는 연산자이고, 오른쪽의 -는 '뺄셈 연산자'이다.
   *  이처럼 모양은 같지만 실제로는 다른 연산자인 경우가 있는데, 이럴 때에는 연산자의 피연산자 개수를 비교하여 구분할 수 있다.
   *
   * */

}
