package chapter.three;

public class Chapter03_13 {

  /** ◆ 비교 연산자
   *
   * 비교 연산자는 두 피연산자를 비교하는데 사용되는 연산자이다. 주로 조건문이나 반복문에 사용되며
   * 연산결과는 오로지 true, false 둘 중의 하나이다.
   *
   * 비교 연산자 역시 연산자이므로 비교하는 피연산자의 타입이 다를 경우에는 자료형의 범위가 큰 쪽으로 자동 형변환하여
   * 피연산자의 타입을 일치시킨 후 비교한다.
   *
   * 1. 대소비교 연산자 : <, >, <=, >=
   * 두 피연산자 간의 값의 크기를 비교하느 연산자이다. boolean을 제외한 나머지 기본형 타입에 사용할 수 있지만 참조형 타입에는 사용할 수 없다.
   *
   * 2. 등가비교 연산자 : ==, !=
   * 두 피연산자의 값이 같은지 다른지를 비교하는 연산자이다. 대소비교 연산자와 달리 모든 자료형(기본형, 참조형)에 사용할 수 있다.
   * 기본형의 경우 변수에 저장된 값이 같은지를 알 수 있고, 참조형의 경우 객체의 주소값을 저장하기 때문에 두 개의 피연산자가 같은 객체를 가리키고 있는지 알 수 있다.
   * 기본형과 참조형은 서로 형변환이 가능하지 않기 때문에 그 둘을 비교할 수는 없다.
   *
   * 일반적인 상식과 다른 점 하나는, '두 값이 같다'라는 의미로 '='가 아닌 '=='를 사용한다는 것이다. '='는 이미 배운 바와 같이
   * 오른쪽의 값을 왼쪽에 저장한다는 뜻의 대입 연산자이기 때문에 비교 연산자로 쓰일 수 없다.
   * */

}
