package chapter.three;

public class Chapter03_05 {

  /** ◆ 증감 연산자 ++, --
   *
   * 증감 연산자는 피연산자에 저장된 값을 1 증가 또는 감소시키는 연산자이다. 증감 연산자의 피연산자로 정수와 실수가 가능하고
   * 상수는 값을 변경할 수 없으므로 피연산자가 될 수 없다ㅏ.
   *
   *  증가 연산자(++) → 피연산자의 값을 1 증가시킨다.
   *  감소 연산자(--) → 피연산자의 값을 1 감소시킨다.
   *
   * 일반적으로 단항 연산자는 피연산자의 왼쪽에 위치하지만, 증감 연산자의 경우 피연산자의 좌우 모두에 위치할 수 있다.
   * 피연산자의 왼쪽에 위치하는 경우 전위형(prefix), 오른쪽에 위치하는 경우를 후위형(postfix)라 한다.
   *
   *  전위형과 후위형의 차이는 다음과 같다.
   *  1. 전위형 : 값이 참조되기 전에 증가시킨다. j = ++i;
   *  2. 후위형 : 값이 참조된 후에 증가시킨다. j = i++;
   *
   *  그러나 '++i;' 또는 'i++;'처럼 증감연산자가 수식이나 메소드 호출에 포함되지 않고 독립적으로 사용되는 경우
   *  전위형과 후위형에 차이는 없다.
   *
   * */

  public static void main(String[] args) {

    int i = 5, j = 0;

    j = i++;
    System.out.println("j = i++ 실행 후, i = " + i + ", j = " + j);

    j = 0;
    i = 5;

    j = ++i;
    System.out.println("j = ++i 실행 후, i = " + i + ", j = " + j);

  }
 /**
  * 증감연산자가 포함된 식을 이해하기 어렵다면 다음과 같이 증감 연산자를 따로 떼어내서 생각하면 편하다.
  *
  *  전위형의 경우, j = ++i;  →  ++i;
  *                           j = i;
  *  ----------------------------------
  *  후위형의 경우, j = i++;  →  j = i;
  *                           i++;
  *  *
  * */

}
