package chapter.three;

public class Chapter03_01 {

  /** ◆ 연산자와 피연산자
   *
   * 연산자는 '연산을 수행하는 기호'를 말한다. 예를 들어 +기호는 덧셈 연산을 수행하며, '덧셈 연산자'라고 한다. 자바에서는 사칙연산을 비롯한
   * 다양한 연산자를 제공한다. 연산자가 연산을 수행하려면 반드시 '연산의 대상'이 필요한데, 이것을 '피연산자'라고 한다.
   *
   *  다음과 같이 'x + 3'이라는 식이 있을 때, '+'는 두 피연산자를 더해서 그 결과를 반환하는 덧셈 연산자이고, 변수 x와 상수 3은 피연산자이다.
   * 연산자와 피연산자를 조합하여 계산하고자 하는 바를 표현한 것을 '식(expression)'이라고 하고 식을 계산하여 결과를 얻는 것을
   * '식을 평가(evaluation)한다'라고 한다.
   *
   *  → 하나의 식을 평가하면, 반드시 단 하나의 결과를 얻는다.
   *
   * [4 * 5 + 3] 식이 평가되어 23이라는 결과를 얻었지만 이 값이 저장되지 않는다면 아무 쓸모가 없을 것이다. 따라서
   * 대입연산자 = 를 사용하여 식을 통해 얻은 결과를 변수에 저장해야 한다.
   *  y = 4 * x + 3
   *
   *
   *
   * */
}
