package chapter.one;

public class Chapter01_08 {

  /**
  * ◆ 첫 번째 자바 프로그램 만들기
  *
  * 자바 프로그램을 개발하기 위해 이클립스나 인텔리제이 같은 통합 개발 환경(IDE)을 이용할 수 있지만, 지금은 메모장으로 간단한 자바 프로그램을 작성해 보자.
  *
  *  class Hello {
  *   public static void main(String[] args) {
  *     System.out.println("Hello, world");
  *   }
  * }
  *
  * 화면에 Hello, world 를 출력하는 아주 간단한 프로그램이다.
  *
  * 이것을 실행하려면 먼저, 자바 컴파일러(javac.exe)를 사용해서 소스파일(Hello.java)로부터 클래스파일(Hello.class)를 생성해야 한다.
  * 그 다음 자바 인터프리터(java.exe)로 실행한다.
  *
  * ---------------------------------------------------------------------------------------------------------
  *
  *     Hello.java(소스파일 작성)         →          Hello.class 생성              →          Hello, world 출력
  *                           javac.exe(컴파일러)                        java.exe(인터프리터)
  *
  * ---------------------------------------------------------------------------------------------------------
  * 자바에서 모든 코드는 반드시 클래스 안에 존재해야 하며, 이 클래스들이 모여 하나의 java 어플리케이션을 이룬다.
  *
  * 코드 중 'public static void main(String[] args) {}' 부분은 main메서드라고 하는 것인데, 프로그램을 실행할 때,
  * java.exe에 의해 호출될 수 있도록 미리 약속된 부분이므로 항상 똑같이 적어주어야 한다.
  * java 어플리케이션은 main메서드의 호출로 시작해서 main메서드의 첫 문장부터 마지막 문장까지 수행을 마치면 종료된다.
  *
  * 모든 클래스가 main메서드를 가지고 있어야 하는 것은 아니지만, 모든 java어플리케이션은 main메서드를 포함한 클래스를 반드시 하나 이상 가져야 한다.
  *
  * 콘솔에서 java Hello 가 입력되면 다음과 같은 일이 진행된다.
  *
  * 1. 프로그램의 실행에 필요한 클래스(.class파일)을 로드한다.
  * 2. 클래스 파일을 검사한다.(파일 형식, 악성코드 체크)
  * 3. 지정된 클래스(Hello)에서 main(String[] args)를 호출한다.
  *
  * 만약 main메서드가 없다면 에러 메세지가 나타날 것이다.
  *
  *
  *
  * 주석(Comment)
  *
  * 주석을 이용해서 프로그램 코드에 대한 설명을 적절히 덧붙여 놓으면, 프로그램을 이해하는 데 많은 도움이 된다.
  * 그 외에도 주석은 프로그램의 작성자, 작성일시, 버전과 그에 따른 변경 이력 등의 정보를 제공할 목적으로 사용된다.
  * 컴파일러는 주석을 무시하고 건너뛰기 때문에 주석이 많다고 해서 프로그램의 성능이 떨어지는 일은 없다.
  *
  *
  */

}
