package chapter.one;

public class Chapter01_01 {

  /**
   *  ◆ Java란?
   *  썬 마이크로시스템즈 (이하 썬)에서 개발하여 1996년 1월에 공식적으로 발표한 객체지향 프로그래밍 언어이다.
   *  자바의 가장 중요한 특징은 운영체제에 독립적이라는 것이다. 자바로 작성된 프로그램은 운영체제의 관계없이 실행이 가능하기 때문에, 운영체제에 따라 프로그램을
   * 변경하지 않고도 실행이 가능하다. 이러한 장점으로 자바는 다양한 기종의 컴퓨터와 운영체제가 공존하는 환경에서 적합한 언어로 많은 사용자층을 확보할 수 있었다.
   * 또한 객체지향 개념과 기존의 다른 프로그래밍언어, 특히 C++의 장점을 채택하는 동시에 잘 사용되지 않는 부분은 과감히 제외시킴으로써 비교적 배우기가 쉽고
   * 이해하기 쉬운 간결한 표현이 가능하도록 했다.
   *
   *  자바는 풍부한 클래스 라이브러리(Java API)를 통해 프로그래밍에 필요한 요소들을 기본적으로 제공하기 때문에
   * 자바 프로그래머는 단순히 이 클래스 라이브러리만을 잘 활용해도 강력한 기능의 자바 프로그램을 작성할 수 있다.
   *
   *  지금도 자바는 꾸준히 자바의 성능을 개선하여 새로운 버전을 발표하고 있으며 그 영역을 넓혀가고 있다.
   * ※ 2010년 썬은 오라클사에 인수되면서 자바는 오라클사의 제품이 되었다.
   *
   *  */
}
