package chapter.one;

public class chapter01_04 {
  /*
  * 자바 가상 머신(JVM)
  *
  * JVM이란 'Java Virtual Machine' 의 약자로 자바를 실행하기 위한 가상 컴퓨터라고 이해하면 좋다.
  * '가상 컴퓨터'란 실제 컴퓨터(하드웨어)가 아닌 소프트웨어로 구현된 컴퓨터라는 뜻으로 컴퓨터 속의 컴퓨터라고 생각할 수 있다.
  *
  * 자바로 작성된 애플리케이션은 모두 이 가상 컴퓨터(JVM)에서만 실행되기 때문에, 자바 애플리케이션이 실행되기 위해서는 이 JVM이 반드시 필요하다.
  *
  *           자바 어플리케이션
  *                ↓
  *               JVM             일반 어플리케이션
  *                ↓                   ↓
  *           OS(Windows)         OS(Windows)
  *                ↓                   ↓
  *           컴퓨터(하드웨어)       컴퓨터(하드웨어)
  *
  *
  * 일반 애플리케이션 코드는 OS만 거치고 하드웨어로 전달되는데, 자바 어플리케이션은 JVM을 한번 더 거치기 때문에, 그리고 하드웨어에 맞게
  * 완전히 컴파일되는 것이 아니라 실행 시에 해석(interpret)되기 때문에 속도가 느리다는 단점을 가지고 있다.
  *
  * 그러나 일반 애플리케이션은 OS와 바로 맞닿아 있기 때문에 OS에 종속적이다. 따라서 다른 OS에서 실행시키기 위해서는 애플리케이션을 그 OS에 맞게
  * 다시 변경해주어야 한다. 반면, 자바 어플리케이션은 JVM하고만 상호작용을 하기 때문에 OS와 하드웨어에 독립적이라 다른 OS에서도 프로그램의 변경없이 실행이 가능하다.
  * 단, JVM은 OS에 종속적이기 때문에 해당 OS에서 실행가능한 JVM이 필요하다.
  *
  *      JVM(Windows용)         JVM(Macintosh용)        JVM(Linux용)
  *            ↓                      ↓                     ↓
  *        OS(Windows)           OS(Macintosh)           OS(Linux)
  *
  * */
}
