package chapter.five;

public class Chapter05_05 {

  /** ◆ 배열의 초기화
   *
   * 배열은 생성과 동시에 자동적으로 기본값(0)으로 초기화 되므로 배열을 사용하기 위해 초기화 해주지 않아도 된다.
   * 다만 원하는 값을 배열에 저장하려면 각 요소마다 값을 직접 지정해주어야 한다.
   *
   *    int[] score = new int[5];
   *    score[0] = 50;
   *    score[1] = 60;
   *    score[2] = 70;
   *    score[3] = 80;
   *    score[4] = 90;
   *
   * 위 코드는 다음과 같이 바꿔 쓸 수 있는데,
   *
   *  for (int i = 0; i < score.length; i++) {
   *    score[i] = i * 10 + 50;
   *  }
   *
   * 이렇게 for 문을 사용하려면 배열에 넣으려는 값에 일정한 규칙이 있어야 한다. 때문에 자바에서는 다음과 같이
   * 배열을 간단하게 초기화 할 수 있는 방법을 제공한다.
   *
   *  int[] score = new int[]{ 50, 60, 70, 80, 90};
   *  int[] score = { 50, 60, 70, 80, 90}; // new int[]를 생략할 수도 있음.
   *
   * 다만 배열의 선언과 생성을 따로 하는 경우에는 new int[] 생략이 불가능하다.
   *
   *  int[] score;
   *  score = { 50, 60, 70, 80, 90}; //에러. new int[]를 생략할 수 없음.
   *
   *
   *
   *
   * */

}
