package chapter.five;

public class Chapter05_01 {

  /** ◆ 배열 Array
   *
   * 같은 타입의 여러 변수를 하나의 묶음으로 다루는 것을 '배열(Array)'이라고 한다.  많은 양의 데이터를
   * 저장하기 위해서 , 그 데이터의 갯수만큼 변수 선언을 해야한다면 매우 혼란스러울 것이다. 만약 10,000개의 데이터를
   * 저장하기 위해 똑같이 10,000개의 변수를 선언한고 사용한다면 그 데이터의 관리는 아주 혼잡할 수 밖에 없다.
   * 이러한 경우에, 배열을 사용하면 많은 양의 데이터를 손쉽게 다룰 수 있다.
   *
   *  "배열이란, 같은 타입의 여러 변수를 하나의 묶음으로 다루는 것"
   *
   * 여기서 중요한 것은 '같은 타입' 이어야 한다는 것이며, 서로 다른 타입의 변수들로 구성된 배열은 만들 수 없다.
   * 예를 들어, 학생 5명의 점수를 저장하기 위해 다음과 같이 배열을 생성할 수 있다.
   *
   *  int[] score = new int[5];
   *
   * 이때 값을 저장할 수 있는 공간은 score[0]부터 score[4]까지 모두 5개이며, 변수 score는 배열을 다루는데
   * 필요한 참조변수일 뿐 값을 저장하는 공간은 아니다.
   *
   *   score     → score[0]  score[1]  score[2]  score[3]  score[4]
   *  -------     -------    -------   -------   -------   --------
   *  |0x100|     |  0  |    |  0  |   |  0  |   |  0  |   |  0  |
   *  -------    -------     -------   -------   -------  --------
   *
   *  위 그림에서도 알 수 있듯이, 변수와 달리 배열은 각 저장공간이 연속적으로 배치되어 있다는 특징이 있다.
   * */

}
