package chapter.five;

public class Chapter05_02 {

  /** ◆ 배열의 선언과 저장
   *
   * 배열을 선언하는 방법은 간단하다. 원하는 타입의 변수를 선언하고, 그 뒤에 배열을 의미하는 대괄호[]을 붙여주면 된다.
   * 대괄호[]는 타입 뒤에 붙여도 되고 변수이름 뒤에 붙여도 된다.
   *
   *  배열 선언 방법    |   선언 예
   *  타입[] 변수명;   |   int[] score;
   *                   String[] name;
   *
   *  타입 변수명[];  | int score[];
   *               | String name[];
   *
   * 배열의 생성
   * 배열을 선언한 뒤에는 배열을 생성해야 한다. 배열을 선언하는 것은 단지 생성된 배열을 다루기 위한 참조변수 공간이 만들어질 뿐이고,
   * 배열을 생성해야만 비로소 값을 저장하는 공간이 만들어지게 된다. 배열을 생성하기 위해서는 연산자 'new' 와 함께 배열의 타입과 길이를 지정해야 한다.
   *
   *  타입[] 변수명;  → 배열을 선언(참조변수 생성)
   *  변수명 = new 타입[길이]; → 배열을 생성(실제 저장공간을 생성)
   *
   *  int[] score; //배열 선언
   *  score = new int[5];//배열 길이가 5인 배열 생성
   *
   * 또는 다음과 같이 배열 선언과 생성을 동시에 하여 한 줄로 코드를 작성할 수도 있다.
   *
   *  타입[] 변수명 = new 타입[길이];
   *  int[] score = new int[5];
   *
   *
   *
   * */

}
