package chapter.five;

public class Chapter05_03 {

  /** ◆ 배열의 인덱스
   *
   * 배열의 각 저장공간을 '배열의 요소(element)' 라고 하며, 배열이름[인덱스]의 형식으로 배열의 요소에 접근한다.
   * 인덱스(index)는 배열의 요소마다 붙여진 일련번호로 각 요소를 구별하는데 사용된다.
   * 인덱스는 1이 아닌 0부터 시작한다.
   *
   *  "인덱스의 범위는 0부터 '배열의 길이 - 1' 까지이다."
   *
   * 예를 들어 길이가 5인 배열은 모두 5개의 요소를 가지며 인덱스의 범위는 1 ~ 5가 아닌 0부터 4까지이다.
   * 배열의 각 값을 저장하고 읽어오는 방법은 변수와 같다. 단지 변수이름 대신 '배열이름[인덱스]'를 사용한다는 점이 다르다.
   *
   * score[3] = 100; // 배열 score 의 4번째 요소에 100을 저장한다.
   * int value = score[3]; // 배열 score 의 4번째 요소 값을 읽어서 value 에 저장한다.
   *
   * 배열의 또 다른 장점은 index 로 상수 대신 변수나 수식도 사용할 수 있다는 것이다.
   * 예를 들어 다음과 같은 코드가 가능하다.
   *
   *  for (int i = 0; i <=3; i++) {
   *    score[i] = i * 10;
   *  }
   *
   *
   *
   *
   * */

}
