package chapter.seven_2nd._19;

public class Chapter07_19 {

  /** ◆ final - 마지막의, 변경될 수 없는
   *
   * final 은 '마지막의' 또는 '변경될 수 없는' 의 의미를 가지고 있으며 거의 모든 대상에 사용될 수 있다.
   * 변수에 사용되면 값을 변경할 수 없는 상수가 되며, 메서드에 사용되면 오버라이딩을 할 수 없게 되고 클래스에 사용되면 자신을
   * 확장하는 자손 클래스를 정의하지 못하게 한다. 즉, 상속할 수 없게 한다.
   *
   * ======================= 각 멤버에 붙은 final 의 의미==================================
   * 1. final 클래스 : 변경될 수 없는 클래스. 확장될 수 없는 클래스이다. 즉 상속할 수 없는 클래스가 된다.
   * 2. final 메서드 : 변경될 수 없는 메서드. 즉 오버라이딩 할 수 없는 메서드가 된다.
   * 3. final 변수 : 변경할 수 없는 변수. 즉, 값을 변경할 수 없는 상수가 된다.
   *
   * ※ final 클래스의 대표적인 예는 String 과 Math 클래스가 있다.
   *
   *
   *
   *
   * */

}

final class FinalTest { // 상속할 수 없는 final 클래스
  final int MAX_SIZE = 10; //값을 변경할 수 없는 멤버변수(상수)

  final void getMaxSize() { //오버라이딩할 수 없는 메서드
    final int LV = MAX_SIZE; // 값을 변경할 수 없는 지역변수
  }
}
