package chapter.six_2nd._06;

public class Chapter06_6 {
  /**
   *  ◆ 객체의 생성과 사용
   *
   *  Tv 클래스를 선언한 것은 Tv 설계도를 작성한 것에 불과하므로 Tv 인스턴스를 생성해야 제품(Tv)를 사용할 수 있다. 클래스로부터
   *  인스턴스를 생성하는 방법은 여러 가지가 있지만 일반적으로는 다음과 같이 한다.
   *
   *  ===============================================================================
   *  클래스명 변수명;  // 클래스의 객체를 참조하기 위한 참조변수 선언
   *  변수명 = new 클래스명(); // 클래스의 객체를 생성 후, 객체의 주소를 참조변수에 저장
   *
   *  Tv t; // Tv 클래스 타입의 참조변수 t 선언
   *  t = new Tv(); // Tv 인스턴스를 생성한 후, 생성된 Tv 인스턴스의 주소를 t 에 저장
   *  ===============================================================================
   *
   *
   * */

}
