package chapter.six_2nd._06;

public class Ex6_1 {

  public static void main(String[] args) {
    Tv t; // Tv 인스턴스를 참조하기 위한 참조변수 t 선언
    t = new Tv(); // Tv 인스턴스를 생성하고 그 인스턴스의 메모리 주소를 t 에 저장
    t.channel = 7; // Tv 인스턴스의 멤버변수 channel 의 값을 7로 변경
    t.channelDown(); // Tv 인스턴스의 메서드 channelDown() 을 호출한다.
    System.out.printf("현재 채널은 %d번 입니다. %n", t.channel);

  }
}

class Tv {
  // Tv 객체의 속성과 기능을 클래스의 변수와 메서드에 대응시켜 작성한다.
  //1. Tv 객체의 속성
  String color; //색상
  boolean power; //전원상태(On/off)
  int channel; // 채널

  //2. Tv 객체의 기능
  void power() { // Tv 의 전원을 키거나 끈다.
    power = !power;
  }
  void channelUp() { //Tv 의 채널을 올린다
    channel++;
  }
  void channelDown() { //Tv 의 채널을 내린다.
    channel--;
  }
}

/**
 * 1. Tv t; // Tv 클래스 타입의 참조변수 t 를 선언한다. 메모리에 참조변수 t를 위한 공간이 마련된다. 아직 인스턴스가 생성되지 않았으므로
 * 이 참조변수로 할 수 있는 것은 아무것도 없다.
 *
 * 2. t = new Tv(); // 연산자 new 에 의해 Tv 클래스의 인스턴스가 메모리의 빈 공간에 생성된다. 주소가 0x100 인 곳에 생성되었다고
 * 가정하자. 이 때 멤버변수는 각 자료형에 해당하는 기본값으로 초기화 된다.
 *
 *  그 다음에는 대입 연산자(=)에 의해서 생성된 객체의 주소값이 참조변수 t에 저장된다. 이제는 참조변수 t 를 통해 Tv 인스턴스에 접근할 수 있다.
 *  인스턴스를 다루기 위해서는 참조변수가 반드시 필요하다. 이 때 참조변수 t가 Tv 인스턴스를 '가리키고 있다' 또는 '참조하고 있다' 라고 표현한다.
 *
 * 3. t.channel = 7;
 * 참조변수 t 에 저장된 주소에 있는 인스턴스의 멤버변수 channel 에 7을 저장한다. 여기서 알 수 있는 것처럼, 인스턴스의 멤버변수(속성)을 사용하려면
 * '참조변수.멤버변수' 와 같이 하면 된다.
 *
 * 4. t.channelDown();
 * 참조변수가 참조하고 있는 Tv 인스턴스의 channelDown() 메서드를 호출한다. channelDown() 메서드는 멤버변수 channel 에 저장되어 있는 값을 1만큼 감소시킨다.
 *
 * 5. System.out.println("현재 채널은 " + t.channel + " 입니다. ");
 * 참조변수 t 가 참조하고 있는 Tv 인스턴스의 멤버변수 channel 에 저장되어 있는 값을 출력한다. 현재 channel 의 값은 6이므로 '현재 채널은 6입니다'가 출력된다.
 * 인스턴스와 참조변수의 관계는 우리가 일상생활에서 사용하는 Tv 와 Tv 리모콘의 관계와 같다. Tv 리모컨(참조변수)를 사용하여 Tv (인스턴스)를 다루기 때문이다.
 * 다른 점이라면, 인스턴스는 오직 참조변수를 거쳐야만 다룰 수 있다는 것이다.
 * 그리고 Tv 를 사용하려면 Tv 리모컨을 사용해야 하고 에어컨을 사용하려면 에어컨리모컨을 사용해야 하는 것처럼 Tv 인스턴스를 사용하려면 Tv 클래스 타입의 참조변수가 필요하다.
 *
 * : 인스턴스는 참조변수를 통해서만 다룰 수 있으며, 참조변수의 타입은 인스턴스의 타입과 일치해야 한다.
 *
 * */
