package chapter.four;

public class Chapter04_01 {

  /** ◆ 조건문과 반복문
   *
   *  지금까지는 코드의 실행 흐름이 무조건 위에서 아래로 한 문장씩 순차적으로 진행되었지만,
   * 때로는 조건에 따라 문장을 건너뛰거나 같은 문장을 반복해야할 때도 있을 것이다.
   * 이처럼, 프로그램의 흐름(flow)을 바꾸는 역할을 하는 문장들을 '제어문(control statement)'이라고 한다.
   * 제어문에는 '조건문'과 '반복문'이 있는데 조건문은 조건에 따라 다른 문장이 수행되도록 하고,
   * 반복문은 특정 문장들을 반복해서 수행한다.
   *
   *
   * 1. if문
   * if문은 가장 기본적인 조건문이며, 다음과 같이 '조건식'과 괄호{}로 이루어져 있다. if의 뜻 그대로
   * '만일 조건식이 참(true)이면 괄호{} 안의 문장들을 수행하라.'는 뜻으로 이해하면 된다.
   *
   *  if (조건신) {
   *    //조건식이 true 일때 수행될 문장들을 적는다.
   *  }
   *
   * */

  public static void main(String[] args) {
    int score = 80;

    if (score > 60) {
      System.out.println("합격입니다.");
    }
  }
}
