package chapter.four;

public class Chapter04_03 {

  /** ◆ 블럭{}
   *
   * 괄호{}를 이용해서 여러 문장을 하나의 단위로 묶을 수 있는데, 이것을 '블럭(block)'이라고 한다.
   * 블럭은 { 로 시작해서 }로 끝나게 되는데, } 끝에 ;을 붙이지 않는다는 것을 주의하자.
   * 블럭 안에 있는 문장들은 탭(tab)으로 들여쓰기를 해서 블럭 안에 속한 문장이라는 것을 알기 쉽게 해주는 것이 좋다.
   *
   * 블럭의 시작을 의미하는 {}의 위치는 다음과 같이 두 가지 스타일이 있는데, 각 스타일마다 장단점이 존재한다.
   *
   * 1. if (조건식) {
   *
   *    }
   *
   * 2. if (조건식)
   *   {
   *
   *   }
   *
   * 만일 블럭 내의 문장이 하나뿐일 때는 아래와 같이 괄호{}를 생략할 수 있다.
   * 그러나 이처럼 괄호를 생략할 수 있다고 하더라도 가능하면 생략하지 않고 사용하는 것이 바람직하다.
   *
   *
   *
   * */

}
