package chapter.ten._09;

public class Chapter10_09 {

  /** ◆ 형식화 클래스
   *
   * 성적처리 프로그램을 작성했을 때 각 점수의 평균을 소수점 2자리로 일정하게 맞춰서 출력하려면 어떻게 해야 할까?
   * 평균값에 100을 곱하고 int 형으로 형변환한 다음 다시 100f 로 나누고 반올림하려면 Math.round() 도 써야하고 등등
   * 과정이 복잡할 것이다.
   *
   * 만약 날짜를 형식에 맞춰 출력하려면 숫자보다 더 복잡해진다. Calendar 를 이용해서 년, 월, 일, 시, 분, 초를 각각 별도로
   * 얻어서 조합을 해야 하는 과정을 거쳐야 할 것이다.
   *
   * 자바에서는 이러한 문제를 쉽게 해결할 수 있는 방법을 제공하는데 그것이 바로 형식화 클래스이다. 이 클래스는 java.text 패키지에
   * 포함되어 있으며 숫자, 날짜, 텍스트 데이터를 일정한 형식에 맞춰 표현할 수 있는 방법을 객체지향적으로 설계하여 표준화하였다.
   * 형식화 클래스는 형식화에 사용될 패턴을 정의하는데, 데이터를 정의된 패턴에 맞춰 형식화 할 수 있을 뿐만 아니라 역으로 형식화된 데이터에서
   * 원래의 데이터를 얻어낼 수도 있다.
   *
   * 이외에도 형식화 클래스는 알아두면 편리하게 사용할 좋은 기능들을 가지고 있는데 긴 설명보다도 예제를 통해서 어떻게 활용하는지 이해하는 쪽이
   * 더 빠를 것이다.
   *
   *
   *
   * */

}
