package chapter.eleven._01;

public class Chapter11_01 {

  /** ◆ 컬렉션 프레임워크
   *
   * 컬렉션 프레임워크란, '데이터 군을 저장하는 클래스들을 표준화한 설계' 를 뜻한다. 컬렉션(collection) 은 다수의 데이터, 즉 데이터 그룹을,
   * 프레임워크는 표준화된 프로그래밍 방식을 의미한다.
   *
   * ※ Java API 문서에서는 컬렉션 프레임워크를 '데이터 군을 다루고 표현하기 위한 단일화된 구조(architecture)' 라고 정의하고 있다.
   *
   * JDK 1.2 이전까지는 Vector, Hashtable, Properties  와 같은 컬렉션 클래스, 다수의 데이터를 저장할 수 있는 클래스들을 서로 다른 각자의 방식으로
   * 처리해야 했으나 JDK 1.2 부터 컬렉션 프레임워크가 등장하면서 다양한 종류의 컬렉션 클래스가 추가되고 모든 컬렉션 클래스를 표준화된 방식으로 다룰 수 있도록 체계화 되었다.
   * 컬렉션 프레임워크는 컬렉션, 다수의 데이터를 다루는데 필요한 다양하고 풍부한 클래스들을 제공하기 때문에 프로그래머의 짐을 상당히 덜어주고 있으며, 또한
   * 인터페이스와 다형성을 이용한 객체지향적 설계를 통해 표준화되어 있기 때문에 사용법을 익히기에도 편리하고 재사용성이 높은 코드를 작성할 수 있다는 장점이 있다.
   *
   *
   *
   *
   *
   * */

}
