package chapter.six;

public class Chapter06_38 {

  /** ◆ 변수의 초기화
   *
   * 변수를 선언하고 처음으로 값을 저장하는 것을 '변수의 초기화'라고 한다. 변수의 초기화는 경우에 따라서
   * 필수적이기도 하고 선택적이기도 하지만, 가능하면 선언과 동시에 적절한 값으로 초기화 하는 것이 바람직하다.
   *
   * 멤버변수는 초기화를 하지 않아도 자동적으로 변수의 자료형에 맞는 기본값으로 초기화가 이루어지므로
   * 초기화하지 않고 사용해도 되지만, 지역변수는 사용하기 전에 반드시 초기화해야 한다.
   *
   *  class InitTest{
   *    int x;
   *    int y = x;
   *
   *    void method1() {
   *      int i;
   *      int j = i; //에러 발생.
   *    }
   *  }
   *
   * 인스턴스 변수인 x는 초기화를 하지 않아도 자동적으로 int 형의 기본값인 0으로 초기화되므로
   * 'int y = x;' 가 가능하다. 하지만 method1의 지역변수 i는 자동적으로 초기화되지 않으므로 j 에 값을 저장
   * 할 수 없어 에러가 발생하는 것이다.
   *
   *  ※ 멤버변수(클래스 변수, 인스턴스 변수)와 배열의 초기화는 선택이지만,
   *    지역변수의 초기화는 필수이다.
   *     -------------------------
   *     |   자료형   |   기본값   |
   *     -------------------------
   *     |  boolean  |   false   |
   *     ------------------------
   *     |   char   |   '\u0000'|
   *     -------------------------
   *     | byte, short|     0    |
   *     |    int     |          |
   *     -------------------------
   *     |    long   |    0L     |
   *     -------------------------
   *     |    float  |    0.0F   |
   *     -------------------------
   *     |   double  |    0.0d   |
   *     -------------------------
   *     |  참조형   |    null    |
   *     -------------------------
   *
   * */


}
