package chapter.six;

public class Chapter06_14 {

  /** ◆ 메서드란?
   *
   * '메서드(method)'는 특정 작업을 수행하는 일련의 문장들을 하나로 묶은 것이다. 기본적으로 수학의 함수와
   * 유사하며, 어떤 값을 입력하면 이 값으로 작업을 수행해서 결과를 반환한다.
   * 예를 들어 제곱근을 구하는 메서드 'Math.sqrt()'는 4.0을 입력하면 2.0을 결과로 반환한다.
   *
   * 그저 메서드가 작업을 수행하는데 필요한 값만 넣고 원하는 결과를 얻으면 될 뿐, 이 메서드가 내부적으로
   * 어떤 과정을 거쳐 결과는 만들어내는지 전혀 몰라도 된다. 즉, 메서드에 넣을 값(입력)과 반환하는 결과(출력)만
   * 알면 되는 것이다. 그래서 메서드를 내부가 보이지 않는 블랙박스라고도 한다.
   * 지금까지 빈번히 사용해온 println()나 random()과 같은 메서드들 역시 내부적으로 어떻게 동작하는지 몰라도
   * 사용하는데 아무런 어려움이 없었다.
   *
   * 메서드는 크게 '선언부(header)'와 '구현부(body)'로 이루어져 있다. 메서드를 정의한다는 것은 선언부와
   * 구현부를 작성하는 것을 뜻하며 다음과 같은 형식으로 메서드를 정의한다.
   *
   *  반환 타입 메서드이름(타입 변수명, 타입 변수명,...) {
   *
   *  }
   *
   *  int add(int a, int b) {
   *    int result = a + b;
   *    return result;
   *  }
   *
   *
   * */

}
