package chapter.six;

public class Chapter06_01 {

  /** ◆ 객체지향 언어
   *
   * 객체지향 언어는 기존의 프로그래밍 언어와 다른 전혀 새로운 것이라 아니라, 기존의 프로그래밍 언어에 몇 가지 새로운 규칙을 추가한
   * 보다 발전된 형태의 것이다. 이러한 규칙들을 이용하여 코드 간에 서로 관계를 맺어줌으로써 보다 유기적으로 프로그램을 구성하는 것이
   * 가능해졌다.
   *
   * 객체지향 언어의 주요 특징은 다음과 같다.
   *
   *  ① 코드의 재사용성이 높다.
   *  새로운 코드를 작성할 때 기존의 코드를 이용하여 쉽게 작성할 수 있다.
   *
   *  ② 코드의 관리가 용이하다.
   *  코드 간의 관계를 이용해서 적은 노력으로 쉽게 코드를 변경할 수 있다.
   *
   *  ③ 신뢰성이 높은 프로그래밍을 가능하게 한다.
   *  제어자와 메서드를 이용해서 데이터를 보호하고 올바른 값을 유지하도록 하며,
   *  코드의 중복을 제거하여 코드의 불일치로 인한 오동작을 방지할 수 있다.
   *
   * 객체지향 언어의 가장 큰 장점은 '코드의 재사용성이 높고 유지보수가 용이하다' 는 것이다. 이러한 객체지향 언어의 장점은
   * 프로그램의 개발과 유지보수에 드는 시간과 비용을 획기적으로 개선하였다.
   *
   * 객체지향 프로그래밍은 프로그래머에게 거시적 관점에서 설계할 수 있는 능력을 요구하기 때문에 객체지향 개념을 이해했다 하더라도
   * 자바의 객체지향적 장점들을 충분히 활용한 프로그램을 작성하기란 쉽지 않을 것이다.
   *
   * ※ 매우 중요!
   * ------------------------------------------------------------------------------------------------------------
   * | 너무 객체지향 개념에 얽매여서 고민하기 보다는 일단 프로그램을 기능적으로 완성한 다음, 어떻게 하면 보다 객체지향적으로 |
   * | 코드를 개선할 수 있을지를 고민하여 점차 개선해 나가는 것이 좋다. 이러한 경험들이 축적되어야 프로그램을 객체지향적으로 |
   * | 설계할 수 있는 능력이 길러지는 것이지 처음부터 이론을 많이 안다고 해서 좋은 설계를 할 수 있는 것은 아니다.          |
   * -----------------------------------------------------------------------------------------------------------
   *
   *
   *
   *
   *
   *
   * */

}
