package chapter.six;

public class Chapter06_39 {

  /** ◆ 멤버변수의 초기화
   *
   * 지역변수와 달리 멤버변수는 각 타입의 기본값으로 자동 초기화된다. 그 다음에 명시적 초기화,
   * 초기화 블럭, 생성자 초기화의 순서로 초기화 된다. 그리고 클래스 변수가 인스턴스 변수보다 먼저
   * 초기화 된다. 멤버변수의 초기화에 대해서는 다음과 같은 두 가지만 기억하자.
   *
   *   1. ① 클래스 변수 초기화  →  ② 인스턴스 변수 초기화
   *   2. ① 자동 초기화 → ② 명시적 초기화 → ③ 초기화 블럭 → ④ 생성자 블럭
   *
   *
   * == 명시적 초기화(explicit initialization) ==
   * 변수 선언과 동시에 초기화 하는 것을 명시적 초기화라고 한다. 가장 기본적이면서도 간단한 초기화 방법이므로
   * 여러 초기화 방법 중에서 가장 우선적으로 고려되어야 한다.
   *
   *  class Car {
   *    int door = 4;
   *    Engine engine = new Engine();
   *  }
   *
   *  명시적 초기화가 간단하고 명료하지만, 보다 복잡한 초기화가 필요할 때는 '초기화 블럭(initialization block)'
   *  또는 생성자를 사용해야 한다.
   *
   *  == 초기화 블럭(initialization block) ==
   *  초기화 블럭에는 '클래스 초기화 블럭', '인스턴스 초기화 블럭' 두 가지 종류가 있다. 클래스 초기화 블럭은
   *  이름처럼 클래스변수 초기화에 사용되고 인스턴스 초기화 블럭은 인스턴스 초기화에 사용된다.
   *
   *  초기화 블럭을 작성하려면, 인스턴스 초기화 블럭은 클래스 안에 단순 블록{}으로 만들고 그 안에 코드를 작성한다.
   *  클래스 초기화 블럭인 경우 앞에 static 만 덧붙이면 된다.
   *
   *
   *
   * */

}
