package chapter.six;

public class Chapter06_15 {

  /** ◆ 메서드의 선언부
   *
   * 메서드 선언부는 '메서드의 이름'과 '매개변수 선언' 그리고 '반환타입'으로 구성되어 있으며,
   * 메서드가 작업을 수행하기 위해 어떤 값들을 필요로 하고 작업의 결과로 어떤 타입의 값을 반환하는지에
   * 대한 정보를 제공한다.
   *
   * -------------------------------------------
   *  반환타입  메서드이름  매개변수 선언
   *    int       add    (int a, int b) {...}
   * -------------------------------------------
   *
   * 메서드의 선언부는 변경사항이 발생하지 않도록 신중히 작성해야한다. 후에 선언부를 변경하게 되면
   * 그 메서드가 호출되는 모든 곳을 변경해야 하기 때문이다.
   *
   *
   *  1. 매개변수 선언 (parameter declaration)
   *  매개변수는 메서드가 작업을 수행하는 데 필요한 값들을 제공 받기 위한 것이며, 필요한 값의 개수만큼
   *  변수를 선언하며 각 변수 간의 구분은 쉼표(,)를 사용한다. 한가지 주의할 점은 일반적인 변수 선언과 달리
   *  두 변수의 타입이 같아도 변수의 타입을 생략할 수 없다는 것이다.
   *  만일 값을 전혀 입력받을 필요가 없다면 괄호() 안에 아무것도 적지 않는다.
   *
   *  2. 반환타입(return type)
   *  메서드의 작업수행 결과인 '반환값(return value)'의 타입을 적는다. 단 반환 값이 없는 경우 void 라고 적는다.
   *
   *
   *
   * */

}
