package chapter.six;

public class Chapter06_16 {

  /** ◆ 메서드의 구현부
   *
   * 메서드의 선언부 다음에 오는 괄호{}를 '메서드의 구현부'라고 하는데, 여기에 메서드가 호출
   * 했을 때 수행될 문장들을 넣는다. 우리가 그동안 작성해온 문장들은 모두 main 메서드의 구현부{}에 속한 것이었다.
   *
   * 1. return 문
   * 메서드의 반환타입이 'void' 가 아닌 경우, 구현부{} 안에 'return 반환값;' 이 반드시 포함되어야 한다.
   * 이 문장은 작업을 수행한 결과인 반환값을 호출한 메서드로 전달하는데 이 값의 타입은 반환타입과 일치하거나
   * 적어도 자동 형변환이 가능한 것이어야 한다.
   * 여러 개의 변수를 선언할 수 있는 매개변수와 달리 return 문은 단 하나의 값만 반환할 수 있다.
   *
   * 2. 지역변수(local variable)
   * 메서드 내에 선언된 변수들은 그 메서드 내에서만 사용할 수 있으므로 서로 다른 메서드라면 같은 이름의 변수를
   * 선언해도 된다. 이처럼 메서드 내에 선언된 변수를 지역 변수라 한다.
   *
   * */

}
