package chapter.six;

public class Chapter06_33 {

  /** ◆ 기본 생성자(default constructor)
   *
   * 지금까지는 생성자를 모르고도 프로그래밍을 해왔지만, 사실 모든 클래스에는 반드시
   * 하나 이상의 생성자가 정의되어 있어야 한다.
   *
   * 그러나 지금까지 클래스에 생성자를 정의하지 않고도 인스턴스를 생성할 수 있었던 건
   * 컴파일러가 제공하는 '기본 생성자' 때문이다. 컴파일 할 때, 소스파일(*.java)의 클래스에 생성자가
   * 하나도 정의되어 있지 않으면 컴파일러는 자동적으로 아래와 같은 내용의 기본 생성자를 추가하여 컴파일 한다.
   *
   *  클래스이름() {} //기본 생성자
   *
   * 컴파일러가 자동적으로 추가해주는 기본 생성자는 이처럼 매개변수도 없고 아무런 내용도 없는
   * 아주 간단한 것이다.
   * 그동안 우리는 컴파일러가 제공해주는 기본 생성자를 사용하고 있었던 것이다.
   * 특별한 인스턴스 초기화 작업이 필요하지 않다면 생성자를 별도로 정의하지 않고 기본 생성자를 사용해도 무방하다.
   *
   *
   * */

}
