package chapter.six;

public class Chapter06_17 {

  /** ◆ 메서드의 호출
   *
   * 메서드를 정의했어도 호출되지 않으면 아무 일도 일어나지 않는다. 메서드를 호출해야만 구현부{}의 문장들이
   * 수행된다. 메서드를 호출하는 방법은 다음과 같다.
   *
   *  메서드이름(값1, 값2, ...);
   *
   *  1. 인수(argument)와 매개변수(parameter)
   *  메서드를 호출할 때 괄호 안에 지정해준 값들을 '인수'또는 '인자' 라고 하는데 인자의 개수와 순서는
   *  호출된 메서드에 선언된 매개변수와 일치해야 한다.
   *
   *  그리고 인수는 메서드가 호출되면서 매개변수에 대입되므로 인자의 타입은 매개변수의 타입과 일치하거나
   *  자동 형변환이 가능한것이어야 한다.
   *
   *  반환타입이 void 가 아닌 경우, 메서드가 작업을 수행하고 반환한 값을 대입연산자로 변수에 저장하는 것이 보통이지만
   *  때에 따라서는 저장하지 않아도 문제가 되지 않는다.
   *
   * */

}
