package chapter.six;

public class Chapter06_02 {

  /** ◆ 클래스와 객체
   *
   * 클래스란 '객체를 정의해놓은 것', 또는 클래스는 '객체의 설계도 또는 틀' 이라고 정의할 수 있다. 클래스는 객체를 생성하는데 사용되며
   * 객체는 클래스에 정의된 대로 생성된다.
   *
   *  ①︎ 클래스의 정의 → 클래스란 객체를 정의해 놓은 것
   *  ②︎ 클래스의 용도 → 클래스는 객체를 생성하는데 사용
   *
   * 객체의 사전적인 정의는 '실제로 존재하는 것' 이다. 우리가 주변에서 볼 수 있는 책상, 의자, 자동차와 같이 사물들이 곧 객체이다.
   * 프로그래밍에서의 객체는 클래스에 정의된 내용대로 메모리에 생성된 것을 뜻한다.
   *
   *  ① 객체의 정의 → 실제로 존재하는 것. 사물 또는 개념.
   *  ② 객체의 용도 → 객체가 가지고 있는 기능과 속성에 따라 다름.
   *  ③ 유형의 객체 → 책상, 의자, 자동차, TV 와 같은 사물.
   *  ④ 무형의 객체 → 수학 공식, 프로그램 에러와 같은 논리나 개념.
   *
   *  클래스와 객체의 관계를 실생활에서 예를 들면, 제품 설계도와 제품과의 관계라고 할 수 있다.
   *  TV 설계도(클래스) 는 TV 라는 제품(객체)을 정의한 것이며, TV(객체)를 만드는데 사용된다.
   *
   *   또한 클래스는 단지 객체를 생성하는데 사용될 뿐, 객체 그 자체는 아니다. 우리가 원하는 기능의 객체를 사용하기 위해서는
   *   먼저 클래스로부터 객체를 생성하는 과정이 선행되어야 한다. 우리가 TV를 보기 위해서는 TV(객체)가 필요한 것이지 ︎︎TV 설계도(클래스)가
   *   필요한 것은 아니며, TV 설계도(클래스)는 단지 TV 라는 제품(객체)를 만드는데만 사용될 뿐이다.
   *
   * 그리고 TV 설계도를 통해 TV 가 만들어진 후에야 사용할 수 있다. 프로그래밍에서는 먼저 클래스를 작성한 다음, 클래스로부터
   * 객체를 생성하여 사용한다.
   *
   *  ※ 객체를 사용한다는 것은 객체가 가지고 있는 속성과 기능을 사용한다는 뜻이다.
   *
   *  ===========================
   *      클래스      |    객체
   *  ===========================
   *     제품 설계도   |    제품
   *     TV 설계도    |    TV
   *     붕어빵 기계   |   붕어빵
   *  ===========================
   *
   * */

}
