package chapter.six;

public class Chapter06_03 {

  /** ◆ 객체의 구성요소 - 속성과 기능
   *
   * 객체는 속성과 기능, 두 종류의 구성요소로 이루어져 있으며, 일반적으로 객체는 다수의 속성과 다수의 기능을 갖는다.
   * 즉, 객체는 속성과 기능의 집합이라고 할 수 있다. 그리고 객체가 가지고 있는 속성과 기능을 그 객체의 멤버(구성원, member)라고 한다.
   *
   * 클래스란 객체를 정의한 것이므로 클래스에는 객체의 모든 속성과 기능이 정의되어 있다. 클래스로부터 객체를 생성하면, 클래스에 정의된 속성과
   * 기능을 가진 객체가 만들어지는 것이다.
   *
   * 보다 쉽게 이해할 수 있도록 TV를 예로 들어보자. TV의 속성으로는 전원상태, 크기, 길이, 높이, 색상, 볼륨, 채널과 같은 것들이 있으며
   * 기능으로는 켜기, 끄기, 볼륨 높이기, 채널 변경하기 등이 있다.
   *
   *  ① TV의 속성 : 크기, 길이, 높이, 색상, 볼륨, 채널
   *  ② TV의 기능 : 켜기, 끄기, 볼륨 높이기, 볼륨 낮추기, 채널 변경하기 등
   *
   * 객체지향 프로그래밍에서는 속성과 기능을 각각 변수와 메서드로 표현한다.
   *
   * ----------------------------------
   *  속성(property) → 멤버변수(variable)
   * ----------------------------------
   *  기능(function) → 메서드(method)
   * ----------------------------------
   *
   * ex) 채널 → int channel
   *    채널 높이기 → channelUp() {...}
   *
   * 위에서 분석한 내용대로 TV 클래스를 만들어보면 다음과 같다.
   *
   * class Tv {
   *
   *   String color; //색상
   *   boolean power; //전원 상태
   *   int channel; //채널
   *
   *   void power() {
   *     power = !power;
   *   }
   *   void channelUp() {
   *     channel++;
   *   }
   *   void channelDown() {
   *     channel--;
   *   }
   * }
   *
   *
   * */

}
