package chapter.eleven._41;

public class Chapter11_41 {

  /** ◆ 이진 탐색 트리의 저장 과정
   *
   * 예를 들어 이진 탐색 트리에 7, 4, 9, 1, 5 의 순서로 값을 저장한다고 가정하면 다음과 같은 순서로 진행된다.
   *
   *                  7
   *                /  \
   *              4     9
   *             / \
   *            1   5
   *
   * 첫 번째로 저장되는 값은 루트가 되고, 두 번째 값은 트리의 루트부터 시작해서 값의 크기를 비교하면서 트리를 따라 내려간다.
   * 부모 노드보다 작은 값은 왼쪽에, 큰 값은 오른쪽에 저장하며 내려간다. 이렇게 트리를 구성하면, 왼쪽 마지막 레벨이 가장 작은 값이 되고
   * 오른쪽 마지막 레벨의 값이 제일 큰 값이 될 것이다.
   *
   * 앞서 살펴본 것처럼, 컴퓨터는 알아서 값을 비교하지 못한다. TreeSet 에 저장되는 객체가 Comparable 을 구현하던가 Comparator 를 제공해서
   * 두 객체를 비교할 방법을 알려주어야 한다. 그렇지 않으면, TreeSet 에 값을 저장할 때 예외가 발생한다.
   *
   * */

}
