package chapter.ten._01;

public class Chapter10_01 {

  /** ◆ 날짜와 시간
   *
   * Date 는 날짜와 시간을 다룰 목적으로 JDK 1.0 부터 제공되어온 클래스이다. JDK 1.0이 제공하는 클래스의 수와 기능은
   * 지금과 비교할 수 없을 정도로 빈약했다. Date 클래스 역시 기능이 부족했기 때문에, 서둘러 Calendar 라는 새로운 클래스를
   * 그 다음 버전인 JDK 1.1 부터 제공하기 시작했다. Calendar 는 Date 보다는 훨씬 나았지만 몇 가지 단점들이 발견되었다.
   * 그 후 JDK 1.8부터 'java.time' 패키지로 기존의 단점들을 개선한 새로운 클래스들이 추가되었다.
   *
   * 새로 추가된 'java.time' 패키지만 배우면 좋을텐데, 아쉽게도 Calendar 클래스와 Date 클래스는 자바의 탄생부터
   * 지금까지 20년이 넘게 사용되어 왔고, 지금도 계속 어디에선가는 사용되고 있을 것이다. 따라서 아예 배우지 않는 것은 무리이다.
   * 그렇다고 Calendar 와 Date 클래스를 깊게 배울 필요는 없고 기본적인 몇가지 예제와 활용법만 배워도 충분할 것이다.
   *
   *
   * */

}
