package chapter.seven._42;

public class Chapter07_42 {
  /** ◆ 내부 클래스(Inner Class)
   *
   * 내부 클래스는 클래스 내에 선언된 클래스이다. 클래스에 다른 클래스를 선언하는 이유는 간단하다.
   * 두 클래스가 서로 긴밀한 관계에 있기 때문이다. 한 클래스를 다른 클래스의 내부 클래스로 선언하면 두 클래스의 멤버들 간에
   * 서로 쉽게 접근할 수 있다는 장점과 외부에는 불필요한 클래스를 감춤으로써 코드의 복잡성을 줄일 수 있다는 장점을 얻을 수 있다.
   *
   * ===================================================================
   * 내부 클래스의 장점
   *
   * 1. 내부 클래스에서 외부 클래스의 멤버들을 쉽게 접근할 수 있다.
   * 2. 코드의 복잡성을 줄일 수 있다.(캡슐화)
   * ===================================================================
   *
   * 아래 왼쪽의 A 와 B 두 개의 독립적인 클래스를 오른쪽과 같이 바꾸면 B는 A의 내부 클래스(inner class) 가 되고 A는 B를 감싸는
   * 외부 클래스(Outer class)가 된다.
   *
   *  class A {
   *    ...
   *  }
   *
   *  class B {
   *    ...
   *  }
   *
   *    ↓
   *
   *  class A {
   *    ...
   *    class B {
   *      ...
   *    }
   *    ...
   *  }
   *
   *  이때 내부 클래스인 B는 외부 클래스인 A를 제외하고는 다른 클래스에서 잘 사용되지 않는 것이어야 한다.
   *  내부 클래스는 클래스 내에 선언된다는 점을 제외하고는 일반적인 클래스와 다르지 않다.
   *
   * */

}
