package chapter.six_2nd._17;

public class Chapter06_17 {

  /** ◆ 메서드의 호출
   *
   * 메서드를 정의했어도 호출하지 않으면 아무 일도 일어나지 않는다. 메서드를 호출해야만 구현부 {} 안의 문장들이 수행된다. 메서드를 호출하는
   * 방법은 다음과 같다.
   *
   * ※ main 메서드는 프로그램 실행 시 OS 에 의해 자동적으로 호출된다.
   *
   * =============================================================================================
   * 메서드 호출 방법
   *
   * [메서드이름]([값1], [값2], ...);
   *
   * ex) print99danAll(); // void print99danAll() {...} 메서드를 호출.
   *    int result = add(3, 5); // int add(int x, int y) {...} 를 호출하고, 그 반환값을 result 에 저장.
   *
   * 1. 인수(argument) 와 매개변수(parameter)
   *  메서드를 호출할 때 괄호() 안에 지정해준 값들을 '인수(argument)' 또는 '인자' 라고 하는데, 인자의 개수와 순서는 호출된 메서드에
   *  선언된 매개변수와 일치해야 한다.
   *
   *  그리고 인수는 메서드가 호출되면서 매개변수에 대입되므로, 인자의 타입은 매개변수의 타입과 일치하거나 자동 형변환이 가능한것이어야 한다.
   *
   *
   * */

}
