package chapter.seven;

public class Chapter07_13 {

  /** ◆ 패키지의 선언
   *
   * 패키지를 선언하는 것은 아주 간단하다. 클래스나 인터페이스의 소스파일(.java)의 맨 위에 다음과 같이 한 줄만 적어주면 된다.
   *
   *  package 패키지명;
   *
   * 위와 같은 패키지 선언문은 반드시 소스파일에서 주석과 공백을 제외한 첫 번째 문장이어야 하며, 하나의 소스파일에 단 한번만
   * 선언될 수 있다. 해당 소스파일에 포함된 모든 클래스나 인터페이스는 선언된 패키지에 속하게 된다.
   *
   * 패키지명은 대소문자를 모두 허용하지만, 클래스명과 구분하기 쉽게 하기 위해 보통 소문자로 작성하는 것을 원칙으로 한다.
   *
   * 모든 클래스는 반드시 하나의 패키지에 포함되어야 한다. 그럼에도 불구하고 지금까지 소스파일을 작성할 때 별 다른
   * 패키지 선언 없이도 문제가 없었던 이유는 자바에서 기본적으로 제공하는 '이름 없는 패키지(unnamed package)' 때문이다.
   * 소스파일에 자신이 속할 패키지를 지정하지 않으면 해당 클래스는 자동적으로 '이름 없는 패키지' 에 속하게 된다.
   * 결국 패키지를 지정하지 않아도 모든 클래스들은 같은 패키지에 속하는 셈이다.
   * 간단한 프로그램은 패키지를 지정하지 않아도 문제가 없지만 큰 프로젝트나 Java API 같은 클래스 라이브러리를 작성하는
   * 경우에는 미리 패키지를 구성하여 적용해야 한다.
   *
   * */

}
