package chapter.seven;

public class Chapter07_21 {

  /** ◆ 접근 제어자 (access modifier)
   *
   * 접근 제어자는 멤버 또는 클래스에 사용되어 해당하는 멤버 또는 클래스를 외부에서 접근하지 못하도록 제한하는 역할을 한다.
   * 단, 접근 제어자가 default 인 경우 실제로 default 를 붙이지는 않고 접근 제어자가 지정되어 있지 않다면 자동으로
   * 접근 제어자가 default 로 지정된다.
   *
   *  접근 제어자가 사용될 수 있는 곳 - 클래스, 멤버변수, 메서드, 생성자
   *
   *  ① private : 같은 클래스 내에서만 접근이 가능하다.
   *  ② protected : 같은 패키지 내에서, 그리고 다른 패키지의 자손 클래스에서 접근이 가능하다.
   *  ③ default : 같은 패키지 내에서만 접근이 가능하다.
   *  ④ public : 제한 없이 어디에서든 접근이 가능하다.
   *
   *  public > protected > default > private
   *  오른쪽으로 갈수록 제한 정도가 강해진다.
   *
   * public 은 접근 제한이 전혀 없는 것이고, private 의 경우 같은 클래스 내에서만 사용하도록 제한한다.
   * 그리고 default 는 같은 패키지 내의 클래스에서만 접근이 가능하도록 한다. 마지막으로
   * protected 는 패키지에 관계없이 상속 관계에 있는 자손 클래스라면 접근할 수 있고 또는 같은 패키지 안에서만 접근이 가능하다.
   * 그래서 default 가 protected 보다 접근 제한이 높다고 할 수 있다.
   *
   *
   *
   *
   * */

}
