package chapter.seven;

public class Chapter07_19 {

  /** ◆ final - 마지막의, 변경될 수 없는
   *
   * final 은 '최후의', '변경될 수 없는' 이라는 의미를 가지고 있으며, 거의 모든 대상에 사용될 수 있다.
   *
   * 만약 변수에 final 이 사용되면 값을 변경할 수 없는 상수가 되고, 메서드에 사용되면 오버라이딩 할 수 없게 되고
   * 클래스에 사용되면 자신을 상속하는 자손 클래스를 만들지 못하게 한다.
   *
   * -------------------------------------------------------------------
   * | 제어자  |  대상    |             의미                               |
   * -------------------------------------------------------------------
   *          1. 클래스  : 확장될 수 없는 클래스. 즉, 상속될 수 없는 클래스
   *
   *  final   2. 메서드  : 변경될 수 없는 메서드. 오버라이딩 될 수 없는 클래스.
   *
   *          3. 멤버변수, : 변수 앞에 final 붙으면 값을 변경하지 못하는 상수가 된다.
   *             지역변수
   *--------------------------------------------------------------------
   *
   * */

}

final class FinalTest { //조상이 될 수 없는 클래스
  final int MAX_SIZE = 10; //값을 변경할 수 없는 멤버변수(상수).

  final void getMaxSize() { //오버라이딩 할 수 없는 메서드.
    final int LV = MAX_SIZE; //값을 변경할 수 없는 지역변수(상수).
  }
}