package chapter.seven;

public class Chapter07_06 {

  /** ◆ Object 클래스 - 모든 클래스의 조상
   *
   * Object 클래스는 모든 클래스 상속계층도에서 최상위에 있는 조상 클래스이다. 다른 클래스로부터 상속 받지 않는
   * 모든 클래스들은 자동적으로 Object 클래스를 상속하게 되어 있기 때문에 이것이 가능하다.
   * 예를 들어, 다음과 같이 아무 클래스도 상속 받지 않는 Tv 클래스를 정의하였다고 하면
   *
   *  class Tv {             class Tv extends Object {
   *                  →
   *  }                     }
   *
   * 위의 왼쪽 코드를 컴파일 했을 때, 컴파일러는 자동적으로 extends Object 를 추가함으로써 오른쪽 코드와 같게 만들어 버린다.
   * 이렇게 함으로써 Object 클래스가 모든 클래스의 조상이 되도록 한다. 만일 해당 클래스가 다른 클래스를 상속 받았다고 하더라도
   * 상속계층도를 따라 그 클래스의 조상, 조상의 조상, ... 을 계속 추적한다면 결국 마지막 최상위 조상은 Object 클래스가 된다.
   *
   * 이처럼 모든 상속계층도의 최상위에는 Object 클래스가 위치한다. 그래서 자바의 모든 클래스들은 Object 클래스의 멤버들을
   * 상속 받으며, Object 클래스에 정의된 멤버들을 모두 사용할 수 있는 것이다. 그동안 toString() 이나 equals()와 같은
   * 메서드들을 따로 정의하지 않고도 사용할 수 있었던 이유는 이 메서드들이 Object 클래스에 정의된 것들이기 때문이다.
   *
   *
   * */

}
