package chapter.seven_2nd._12;

public class Chapter07_12 {

  /** ◆ 패키지(package)
   *
   * 패키지란, 클래스의 묶음이다. 패키지에는 클래스 또는 인터페이스를 포함시킬 수 있으며, 서로 관련된 클래스들끼리 그룹 단위로 묶어 놓음으로써
   * 클래스를 효율적으로 관리할 수 있다.
   *
   * 같은 이름의 클래스일지라도 서로 다른 패키지에 존재하는 것이 가능하므로, 자신만의 패키지 체계를 유지하고 다른 개발자가 개발한 클래스 라이브러리
   * 와 이름이 충돌하는 것을 방지할 수 있다.
   *
   * 지금까지는 단순히 클래스 이름만으로 클래스를 구분했지만, 사실 클래스의 실제 이름(full name) 은 패키지명을 포함한 것이다. 예를 들면
   * String 클래스의 실제 이름은 java.lang.String 이다. java.lang 패키지에 속한 String 클래스라는 의미이다. 그래서 같은 이름의 클래스
   * 일지라도 서로 다른 패키지에 속하면 패키지명으로 구별이 가능하다.
   *  클래스가 물리적으로 하나의 클래스 파일(.class) 인 것과 같이 패키지는 물리적으로 하나의 디렉토리이다. 그래서 어떤 패키지에 속한 클래스는
   *  해당 디렉토리에 존재하는 클래스 파일(클래스이름.class) 이어야 한다. 예를 들어, java.lang.String 클래스는 물리적으로 디렉토리
   *  java 의 하위 디렉토리인 lang 에 속한 String.class 파일이다. 그리고 우리가 자주 사용하는 System 클래스 역시 java.lang 에
   *  속하므로 lang 디렉토리에 포함되어 있다. 디렉토리가 하위 디렉토리를 가질 수 있는 것처럼, 패키지도 다른 패키지를 포함할 수 있으며
   *  '점(.)' 으로 구분한다. 예를 들면 java.lang 패키지에서 lang 패키지는 java 패키지의 하위 패키지이다.
   *
   *
   *
   * */

}
