package chapter.eleven._19;

public class Chapter11_19 {

  /** ◆ Stack 과 Queue 의 활용
   *
   * 지금까지 스택과 큐의 개념과 구현에 대해 알아보았는데 이제는 스택과 큐를 어떻게 활용할 것인가에 대해서 살펴보자.
   * 우리가 쉽게 찾아볼 수 있는 스택과 큐의 활용 예는 다음과 같다.
   *
   * 1) 스택의 활용 예 - 수식 계산, 수식괄호 검사, 워드프로세서의 undo/redo, 웹 브라우저의 앞으로/뒤로
   * 2) 큐의 활용 예 - 최근 사용 문서, 인쇄작업 대기목록
   *
   * 스택과 큐는 실제 프로그래밍에서 빈번하게 사용되는 자료구조라고는 하지만 어디에 사용되었고 막상 어떻게 활용해야할지를
   * 생각해보면 잘 떠오르지 않을 것이다.
   *
   * 이제 스택과 큐를 어떻게 활용하는지 감을 잡을 수 있는 몇 가지 예제를 학습해보고 나면 도움이 될 것이다.
   *
   *
   * */

}
