package chapter.seven_2nd._42;

public class Chapter07_42 {

  /** ◆ 내부 클래스 (inner class)
   *
   * 내부 클래스는 클래스 내에 선언된 클래스이다. 클래스에 다른 클래스를 선언하는 이유는 간단하다.
   *
   * ===================================
   * 두 클래스가 서로 긴밀한 관계에 있기 때문이다.
   * ===================================
   *
   * 한 클래스를 다른 클래스의 내부 클래스로 선언하면 두 클래스의 멤버들 간에 서로 쉽게 접근할 수 있다는 장점과 외부에는 불필요한
   * 클래스를 감춤으로써 코드의 복잡성을 줄일 수 있다는 장점을 얻을 수 있다.
   *
   * 내부 클래스의 장점
   * - 내부 클래스에서 외부 클래스의 멤버들에게 쉽게 접근할 수 있다.
   * - 코드의 복잡성을 줄일 수 있다. (캡슐화)
   *
   * class A {
   *   ...
   * }
   *
   * class B {
   *   ...
   * }
   *
   *       ↓
   *
   * class A { //외부 클래스
   *   ...
   *   class B { //내부 클래스
   *     ...
   *   }
   * }
   *
   * 위의 코드처럼 A 와 B 두 개의 독립적인 클래스를 내부 클래스로 변경하면 B 는 A 의 내부 클래스(inner class) 가 되고 A 는 B 를
   * 감싸고 있는 외부 클래스(Outer class) 가 된다.
   *
   * 이때 내부 클래스인 B 는 외부 클래스인 A 를 제외하고는 다른 클래스에서 잘 사용하지 않는 것이어야 한다.
   * 내부 클래스는 클래스 내에 선언된다는 점을 제외하고는 일반적인 클래스와 다르지 않다. 다만 앞으로 배우게 될 내부 클래스의 몇 가지 특징만
   * 잘 이해하면 실제로 활용하는데 어려움이 없을 것이다.
   *
   *
   *
   *
   *
   * */

}
