package chapter.eleven._15;

public class Chapter11_15 {

  /** ◆ Stack 과 Queue
   *
   * 자바에서 제공하는 Stack 과 Queue 에 대해 알아보기 이전에 스택(stack) 과 큐(queue) 의 기본 개념과 특징에 대해 간단히 짚어보자.
   * 스택은 마지막에 저장한 데이터를 가장 먼저 꺼내게 되는 LIFO(Last In First Out) 구조로 되어 있고,
   * 큐는 처음에 저장한 데이터가 가장 먼저 꺼내게 되는 FIFO(Fist In First Out) 구조로 되어 있다. 쉽게 얘기하자면 스택은 동전통과 같은
   * 구조로 양 옆과 바닥이 막혀 있어서 한 방향으로만 뺄 수 있는 구조이고, 큐는 양 옆만 막혀있고 위아래로 뚫려 있어서 한 방향으로 넣고
   * 반대 방향으로 빼는 파이프와 같은 구조로 되어 있다.
   *
   * 예를 들어, 스택에 0, 1, 2 의 순서로 데이터를 넣었다면 꺼낼 때는 2, 1, 0의 순서로 꺼내게 된다. 즉, 넣은 순서와 꺼낸 순서가 뒤집어지게 되는 것이다.
   * 이와 반대로 큐는 0, 1, 2 의 순서로 데이터를 넣었다면 꺼낼 때도 0, 1, 2 의 순서로 꺼내게 된다. 순서의 변경 없이 먼저 넣은 것을 꺼내게 되는 것이다.
   * 그렇다면 스택과 큐를 구현하기 위해서는 어떤 컬렉션 클래스를 사용하는 것이 좋을까? 순차적으로 데이터를 추가하고 삭제하는 스택에는 ArrayList 와
   * 같은 배열 기반의 컬렉션 클래스가 적합하지만, 큐는 데이터를 꺼낼 때 항상 첫 번째 저장된 데이터를 삭제하므로 ArrayList 를 사용한다면 데이터를 꺼낼 때마다
   * 삭제되어 비어버린 공간을 채우기 위해 데이터의 복사가 발생하므로 비효율적이다. 그래서 큐는 ArrayList 보다 데이터의 추가 / 삭제가 쉬운 LinkedList 로
   * 구현하는 것이 더 적합하다.
   *
   * 스택 → ArrayList 가 적합
   * 큐  → LinkedList 가 적합
   *
   *
   * */

}
