package chapter.six_2nd._38;

public class Chapter06_38 {
  /** ◆ 변수의 초기화
   *
   * 변수를 선언하고 처음으로 값을 지정하는 것을 '변수의 초기화' 라고 한다. 변수의 초기화는 경우에 따라서 필수적이기도 하고, 선택적이기도 하지만,
   * 가능하면 선언과 동시에 적절한 값으로 초기화하는 것이 바람직하다. 멤버변수는 초기화를 하지 않아도 자동적으로 변수의 자료형에 맞는 기본값으로
   * 초기화가 이루어지므로 초기화하지 않고 사용해도 되지만, 지역변수는 사용하기 전에 반드시 초기화해주어야 한다.
   *
   * class InitTest {
   *   int x; //인스턴스 변수
   *   int y = x; //인스턴스 변수
   *
   *   void method1() {
   *     int i; //지역변수
   *     int j = i; //에러. 지역변수를 초기화하지 않고 사용
   *   }
   * }
   *
   * 위의 코드에서 x, y 는 인스턴스 변수이고, i, j 는 지역변수이다. 그 중 x 와 i 는 선언만 하고 초기화를 하지 않았다. 그리고 y를 초기화하는데
   * x를 사용하였고, j 를 초기화 하는데 i 를 사용하였다. 인스턴스 변수 x 는 초기화를 해주지 않아도 자동적으로 int 형의 기본값인 0으로 초기화
   * 되므로, 'int y = x;' 와 같이 할 수 있다. x 의 값이 0이므로 y 역시 0이 저장된다.
   * 하지만, method1() 의 지역변수 i 는 자동적으로 초기화되지 않으므로, 초기화 되지 않은 상태에서 변수 j 를 초기화 하는데 사용될 수 없다.
   * 만약 이를 컴파일하면 에러가 발생할 것이다.
   *
   * ================================================================================
   * 멤버변수(클래스 변수와 인스턴스 변수) 와 배열의 초기화는 선택이지만,
   * 지역변수의 초기화는 필수이다.
   * ================================================================================
   *
   * 참고로 각 타입의 기본값(default value) 는 다음과 같다.
   *
   * ① boolean : false
   * ② char    : '\u0000'
   * ③ byte, short, int : 0
   * ④ long : 0L
   * ⑤ float : 0.0f
   * ⑥ double : 0.0d 또는 0.0
   * ⑦ 참조형 : null
   *
   *
   *
   *
   * */

}
