package chapter.eleven.exercise;

public class Ex11_2 {

  /*
  * 11-2. 다음 중 ArrayList 에서 제일 비용이 많이 드는 작업은? 단, 작업 도중에 ArrayList 의 크기 변경이 발생하지 않는다고 가정한다.
  *
  * ① 첫 번째 요소 삭제
  * ② 마지막 요소 삭제
  * ③ 마지막에 새로운 요소 추가
  * ④ 중간에 새로운 요소 추가
  *
  * sol: ①
  * ArrayList 는 각 요소들이 직선형태로 죽 늘어선 배열구조를 가지고 있다.
  * 그래서 만약 ArrayList 에서 맨 뒤에 위치한 요소를 삭제한다면 그저 마지막 요소만 제거하면 되는 일이므로 그것은 기존의 나머지 요소들 위치에 영향을 주지 않고 작업에 필요한 비용도 크지 않다.
  * 그러나 맨 처음 또는 중간에 위치한 요소를 삭제한다면 나머지 요소들은 삭제된 요소의 공간을 채우기 위해 다시 재정렬되어야 할 것이고 그만큼 필요한 비용도 증가하게 된다.
  *
  * 결론적으로, ArrayList 에서 맨 앞에 위치한 요소를 삭제하는 경우, 나머지 모든 요소들이 앞으로 한칸씩 위치를 옮겨야 하므로 가장 큰 비용이 들게 된다.
  *
  *
  * */

}
